UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака/рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака</name>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_СопоставленныеСклады/рар_мп_СопоставленныеСклады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_СопоставленныеСклады</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <attributes>
    <name>НазваниеСкладаНаМаркетплейсе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЯМ_campaignId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ЯндексМаркет_СопоставленныеТовары/рар_мп_ЯндексМаркет_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ЯндексМаркет_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SKUЯндексМаркета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СхемыРаботы/рар_мп_СхемыРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СхемыРаботы</name>
  <enumValues>
    <name>FBS</name>
  </enumValues>
  <enumValues>
    <name>FBO</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СтатусыДокументовВТСД/рар_мп_СтатусыДокументовВТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СтатусыДокументовВТСД</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_ЯндексМаркет_СтатусыЗаказов/рар_мп_ЯндексМаркет_СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_ЯндексМаркет_СтатусыЗаказов</name>
  <enumValues>
    <name>CANCELLED</name>
  </enumValues>
  <enumValues>
    <name>DELIVERED</name>
  </enumValues>
  <enumValues>
    <name>DELIVERY</name>
  </enumValues>
  <enumValues>
    <name>PICKUP</name>
  </enumValues>
  <enumValues>
    <name>PROCESSING</name>
  </enumValues>
  <enumValues>
    <name>UNPAID</name>
  </enumValues>
  <enumValues>
    <name>UNKNOWN</name>
  </enumValues>
  <enumValues>
    <name>PENDING</name>
  </enumValues>
  <enumValues>
    <name>RESERVED</name>
  </enumValues>
  <enumValues>
    <name>PLACING</name>
  </enumValues>
  <enumValues>
    <name>PARTIALLY_RETURNED</name>
  </enumValues>
  <enumValues>
    <name>RETURNED</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/CommonModules/рар_мп_ЗагрузкаЗаказов/Module.bsl
#Область ЯндексМаркет

Процедура ЯндексМаркет_ЗагрузкаЗаказов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
		|	ЗаказКлиента.рар_мп_АккаунтМаркетплейса КАК АккаунтМаркетплейса
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.рар_мп_АккаунтМаркетплейса.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.ЯндексМаркет)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СозданныеЗаказыКлиентов = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт КАК Аккаунт,
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	РегистрСведений.рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака КАК рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака
		|ГДЕ
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт.ПометкаУдаления = ЛОЖЬ
		|	И рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.ЯндексМаркет)
		|	И рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт.АктивныйАккаунт = ИСТИНА
		|	И рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВидыНоменклатурыДляЧестногоЗнака = РезультатЗапроса.Выгрузить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса КАК АккаунтМаркетплейса,
		|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
		|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.Наименование КАК АккаунтМаркетплейсаНаименование,
		|	рар_мп_СопоставленныеСклады.рар_мп_ЯМ_campaignId КАК рар_мп_ЯМ_campaignId
		|ИЗ
		|	РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
		|ГДЕ
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.АктивныйАккаунт = ИСТИНА
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.ЯндексМаркет)
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.ПометкаУдаления = ЛОЖЬ
		|	И рар_мп_СопоставленныеСклады.Склад.ПометкаУдаления = ЛОЖЬ
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АккаунтМаркетплейса,
		|	УникальныйИдентификаторСклада";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СледующаяСтраница = "";
		
		HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ИнформацияОНесколькихЗаказах(ВыборкаДетальныеЗаписи.АккаунтМаркетплейса, 
					ВыборкаДетальныеЗаписи.рар_мп_ЯМ_campaignId, СледующаяСтраница);
					
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда 
						
			Если HTTPОтвет.КодСостояния <> 200 Тогда
							
				НазваниеОшибки = "Ошибка при получении заказов из Яндекс Маркета";
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
										Символы.ПС, ВыборкаДетальныеЗаписи.АккаунтМаркетплейсаНаименование, HTTPОтвет.КодСостояния, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Иначе
				
				Если HTTPОтвет.ОтветAPI.Свойство("paging") Тогда
							
					Если HTTPОтвет.ОтветAPI.paging.Свойство("nextPageToken") Тогда
					
						СледующаяСтраница = HTTPОтвет.ОтветAPI.paging.nextPageToken;	
					
					Иначе
					
						СледующаяСтраница = "";	
					
					КонецЕсли;
				
				Иначе
					
					СледующаяСтраница = "";	
					
				КонецЕсли;
				
				Заказы = HTTPОтвет.ОтветAPI.orders;
				
				ЯндексМаркет_СозданиеЗаказов(Заказы, ВыборкаДетальныеЗаписи.АккаунтМаркетплейса, ВыборкаДетальныеЗаписи.Склад, 
											 ВыборкаДетальныеЗаписи.рар_мп_ЯМ_campaignId, СозданныеЗаказыКлиентов, ВидыНоменклатурыДляЧестногоЗнака);
											 
				Пока СледующаяСтраница <> "" Цикл
												 
					HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ИнформацияОНесколькихЗаказах(ВыборкаДетальныеЗаписи.АккаунтМаркетплейса, 
						ВыборкаДетальныеЗаписи.рар_мп_ЯМ_campaignId, СледующаяСтраница);
						
					Если HTTPОтвет.Свойство("ОтветAPI") Тогда
							
						Если HTTPОтвет.КодСостояния <> 200 Тогда
								
							НазваниеОшибки = "Ошибка при получении заказов из Яндекс Маркета";
							
							ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;
							
							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
													Символы.ПС, ВыборкаДетальныеЗаписи.АккаунтМаркетплейсаНаименование, HTTPОтвет.КодСостояния, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							Прервать;
							
						Иначе
							
							Если HTTPОтвет.ОтветAPI.Свойство("paging") Тогда
								
								Если HTTPОтвет.ОтветAPI.paging.Свойство("nextPageToken") Тогда
								
									СледующаяСтраница = HTTPОтвет.ОтветAPI.paging.nextPageToken;	
								
								Иначе
								
									СледующаяСтраница = "";	
								
								КонецЕсли;
							
							Иначе
								
								СледующаяСтраница = "";	
								
							КонецЕсли;
							
							Заказы = HTTPОтвет.ОтветAPI.orders;
					
							ЯндексМаркет_СозданиеЗаказов(Заказы, ВыборкаДетальныеЗаписи.АккаунтМаркетплейса, ВыборкаДетальныеЗаписи.Склад, 
														ВыборкаДетальныеЗаписи.рар_мп_ЯМ_campaignId, СозданныеЗаказыКлиентов, ВидыНоменклатурыДляЧестногоЗнака);
														 
						КонецЕсли;
						
					Иначе
						
						Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
			
						ЗаписьЖурналаРегистрации("Ошибка при получении загрузке заказов", УровеньЖурналаРегистрации.Ошибка,,,
												 СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, ВыборкаДетальныеЗаписи.АккаунтМаркетплейса),);
						
					КонецЕсли;
				КонецЦикла;							 
				
			КонецЕсли;
			
		Иначе
			
			Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
			
			ЗаписьЖурналаРегистрации("Ошибка при получении загрузке заказов", УровеньЖурналаРегистрации.Ошибка,,,
									 СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, ВыборкаДетальныеЗаписи.АккаунтМаркетплейса),);
	
		КонецЕсли;
				
	КонецЦикла;
	

КонецПроцедуры

Процедура ЯндексМаркет_СозданиеЗаказов(Заказы, Аккаунт, Склад, УникальныйИдентификаторСклада, СозданныеЗаказыКлиентов, ВидыНоменклатурыДляЧестногоЗнака)

	Для каждого Заказ Из Заказы Цикл
		
		Номер = Строка(Формат(Заказ.id,"ЧГ=0"));
		
		НайденныеСтроки = СозданныеЗаказыКлиентов.НайтиСтроки(Новый Структура("НомерПоДаннымКлиента, АккаунтМаркетплейса", Номер, Аккаунт));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
		
			Если Заказ.status = "PROCESSING" И Заказ.substatus = "STARTED" Тогда
				
				Попытка
				
					Документ = Документы.ЗаказКлиента.СоздатьДокумент(); 
					
					//Заполнение данными из 1с
					Документ.Статус 			   				  = Аккаунт.СтатусЗаказа;
					Документ.Приоритет 			   				  = Аккаунт.Приоритет;
					Документ.ХозяйственнаяОперация 				  = Аккаунт.Операция;
					Документ.Организация		   				  = Аккаунт.Организация;
					Документ.Договор 			  				  = Аккаунт.Договор;
					Документ.Склад    			   				  = Склад;
					Документ.Контрагент 		   				  = Аккаунт.Контрагент;
					Документ.Партнер       		   				  = Аккаунт.Партнер;
					Документ.Соглашение 		   				  = Аккаунт.Соглашение;
					Документ.Валюта 			   				  = Аккаунт.Валюта;
					Документ.НеОтгружатьЧастями    				  = Истина;
					Документ.рар_мп_АккаунтМаркетплейса 		  = Аккаунт;
					Документ.рар_мп_УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
					Документ.Дата								  = ПреобразоватьСтрокуВДату(Заказ.creationDate);
					Документ.рар_мп_СтатусДокументаВТСД			  = Перечисления.рар_мп_СтатусыДокументовВТСД.Новый;
					
					Если Документ.Соглашение <> Справочники.СоглашенияСКлиентами.ПустаяСсылка() Тогда
					
						Документ.КонтактноеЛицо = Аккаунт.Соглашение.КонтактноеЛицо;
						Документ.Менеджер       = Аккаунт.Соглашение.Менеджер;
						
					ИначеЕсли Документ.Договор <> Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
						
						Документ.КонтактноеЛицо = Аккаунт.Договор.КонтактноеЛицо;
						Документ.Менеджер 		= Аккаунт.Договор.Менеджер;
						
					КонецЕсли; 
					
					Документ.Подразделение 		= Аккаунт.Подразделение;
					Документ.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
					Документ.НалогообложениеНДС = Аккаунт.НалогообложениеНДС;
					Документ.ЦенаВключаетНДС    = Аккаунт.ЦенаВключаетНДС;
					Документ.Автор 				= ПользователиКлиентСервер.ТекущийПользователь();
					
					//Заполнение данными из маркетплейса
					Документ.рар_мп_ЯндексМаркет_СтатусЗаказа 	 = Перечисления.рар_мп_ЯндексМаркет_СтатусыЗаказов[Заказ.status];
					Документ.рар_мп_ЯндексМаркет_ПодстатусЗаказа = Перечисления.рар_мп_ЯндексМаркет_ПодстатусыЗаказов[Заказ.substatus];
					Документ.НомерПоДаннымКлиента				 = Номер;
					Документ.ДатаПоДаннымКлиента				 = Документ.Дата;
					
					ДатаОтгрузки = Заказ.delivery.shipments.Получить(0).shipmentDate;
					Документ.ДатаОтгрузки = Дата(Прав(ДатаОтгрузки, 4), Сред(ДатаОтгрузки, 4, 2), Лев(ДатаОтгрузки, 2));
					
					Товары = Заказ.items;
					
					ОтказЗаписи = Ложь;
					
					Если Заказ.Свойство("notes") Тогда
					
						Документ.Комментарий = Заказ.notes;
						
					КонецЕсли;
					
					Для каждого Товар Из Товары Цикл
						
						СтрокаДокумента = Документ.Товары.Добавить();
						
						НаборЗаписей = РегистрыСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Аккаунт.Установить(Аккаунт);
						НаборЗаписей.Отбор.SKUТовара.Установить(Товар.offerId);
							
						НаборЗаписей.Прочитать();
						
						Если НаборЗаписей.Количество() > 0 Тогда 
							
							Запись = НаборЗаписей.Получить(0);
							
							СтрокаДокумента.Номенклатура   	   = Запись.Номенклатура;
							СтрокаДокумента.Характеристика 	   = Запись.Характеристика;
							СтрокаДокумента.ВариантОбеспечения = Аккаунт.ВариантОбеспечения;
							СтрокаДокумента.ДатаОтгрузки   	   = Документ.ДатаОтгрузки;
							СтрокаДокумента.Упаковка	   	   = Запись.Упаковка;
							СтрокаДокумента.КоличествоУпаковок = Число(Товар.count);
							СтрокаДокумента.Количество		   = СтрокаДокумента.КоличествоУпаковок * Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(СтрокаДокумента.Упаковка, СтрокаДокумента.Номенклатура);
							СтрокаДокумента.Склад			   = Склад;
							
							СуммаСубстатусов = 0;
							Если Товар.Свойство("subsidies") Тогда
							
								Для каждого Субстатус Из Товар.subsidies Цикл
								
									СуммаСубстатусов = СуммаСубстатусов + Субстатус.amount;		
								
								КонецЦикла;	
							
							КонецЕсли;
							
							Если СуммаСубстатусов <> 0 Тогда
								
								СтрокаДокумента.Цена = Товар.price + (СуммаСубстатусов  / СтрокаДокумента.КоличествоУпаковок);
								
								СтрокаДокумента.Сумма = СтрокаДокумента.КоличествоУпаковок * Товар.price + СуммаСубстатусов;
								
							Иначе
								
								СтрокаДокумента.Цена = Товар.price;
								
								СтрокаДокумента.Сумма = СтрокаДокумента.КоличествоУпаковок * Товар.price;
								
							КонецЕсли;
							
							СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Номенклатура, "СтавкаНДС");
							
							СтрокаДокумента.СтавкаНДС = СтавкаНДС;
							
							СтруктураПересчетаСуммы = Новый Структура;
							СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Документ.ЦенаВключаетНДС);
							СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Документ.НалогообложениеНДС);
							
							СтруктураДействий = Новый Структура;
							СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
							СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
								
							КэшированныеЗначения = Неопределено;
									
							ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(СтрокаДокумента, СтруктураДействий, КэшированныеЗначения);
							
							//Заполнение ТЧ с маркировками
							Для Счетчик = 1 По СтрокаДокумента.Количество Цикл 
						
								СтрокаТоварыКРаспределению = Документ.рар_мп_ТоварыДляМаркировки.Добавить();
								
								СтрокаТоварыКРаспределению.рар_мп_СтрокаИзТЧТовары = Документ.Товары.Индекс(СтрокаДокумента) + 1;
								
								СтрокаТоварыКРаспределению.рар_мп_Номенклатура = СтрокаДокумента.Номенклатура;
								
								СтрокаТоварыКРаспределению.рар_мп_IDТовара = Формат(Товар.id, "ЧГ=0");
								
								СтрокаТоварыКРаспределению.рар_мп_Характеристика = СтрокаДокумента.Характеристика;
								
								ВидНоменклатуры = ВидыНоменклатурыДляЧестногоЗнака.НайтиСтроки(Новый Структура("Аккаунт, ВидНоменклатуры", 
																										Аккаунт,СтрокаДокумента.Номенклатура.ВидНоменклатуры));
																										
								Если Товар.Свойство("requiredInstanceTypes") Тогда
																											
									ГТДНужен = Товар.requiredInstanceTypes.Найти("GTD");
																											
									Если ГТДНужен <> Неопределено Тогда
										
										СтрокаТоварыКРаспределению.рар_мп_ЗаполнениеГТД = Истина;
										
									КонецЕсли;	
																											
								КонецЕсли;
							
								Если ВидНоменклатуры.Количество() > 0 Тогда
								
									СтрокаТоварыКРаспределению.рар_мп_ЗаполнениеМаркировки = Истина;	
								
								КонецЕсли;	
								
							КонецЦикла;
								
						Иначе
							
							ОтказЗаписи = Истина;
							
							Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: Не удалось найти сопоставленный товар с артикулом: %3",
													Аккаунт, Номер, Товар.id);
						
							ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Яндекс Маркет", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
							
							Продолжить;
							
						КонецЕсли;
							
					КонецЦикла; 
					
					Если Не ОтказЗаписи Тогда
						
						Попытка
						
							Документ.Записать(РежимЗаписиДокумента.Проведение);
						
						Исключение 
							  
							Документ.Записать(РежимЗаписиДокумента.Запись);
							
							Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
							
							ЗаписьЖурналаРегистрации("Ошибка при проведении 'Заказа клиента' из Яндекс Маркета", 
													 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						КонецПопытки;
					
					КонецЕсли;
					
				Исключение
					
					Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
					
					ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Яндекс Маркета", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				КонецПопытки;	
				
			КонецЕсли;
			
		Иначе
			
			Попытка
			
				Документ = НайденныеСтроки.Получить(0).Ссылка.ПолучитьОбъект();
				
				Если Документ.рар_мп_ЯндексМаркет_СтатусЗаказа <> Перечисления.рар_мп_ЯндексМаркет_СтатусыЗаказов[Заказ.status] 
					 ИЛИ Документ.рар_мп_ЯндексМаркет_ПодстатусЗаказа <> Перечисления.рар_мп_ЯндексМаркет_ПодстатусыЗаказов[Заказ.substatus] Тогда
					 
					Попытка
					
						Документ.рар_мп_ЯндексМаркет_СтатусЗаказа    = Перечисления.рар_мп_ЯндексМаркет_СтатусыЗаказов[Заказ.status];
						Документ.рар_мп_ЯндексМаркет_ПодстатусЗаказа = Перечисления.рар_мп_ЯндексМаркет_ПодстатусыЗаказов[Заказ.substatus];
						
						Если Перечисления.рар_мп_ЯндексМаркет_СтатусыЗаказов[Заказ.status] = Перечисления.рар_мп_ЯндексМаркет_СтатусыЗаказов.CANCELLED Тогда
						
							ПричинаОтменыЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "ПричинаОтменыЗаказа");
							
							Если ЗначениеЗаполнено(ПричинаОтменыЗаказа) Тогда
							
								Для каждого СтрокаТчТовары Из Документ.Товары Цикл
								
									СтрокаТчТовары.Отменено = Истина;
									
									СтрокаТчТовары.ПричинаОтмены = ПричинаОтменыЗаказа;
								
								КонецЦикла;
								
								Документ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
							
							Иначе
								
								ОписаниеОшибки = "В личном кабинете не указана причина отмены заказа";
								
								Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки);
							
								ЗаписьЖурналаРегистрации("Ошибка при закрытии документа 'Заказ клиента' после отмены заказа в Яндекс Маркет", 
												 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);	
							
							КонецЕсли;
						
						КонецЕсли;
						
						Документ.Записать(РежимЗаписиДокумента.Проведение);
					
					Исключение
						
						Документ.Записать(РежимЗаписиДокумента.Запись);
						
						Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
						
						ЗаписьЖурналаРегистрации("Ошибка при изменении статуса 'Заказа клиента' из Яндекс Маркет", 
												 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,); 
					
					КонецПопытки;
					 
					
				КонецЕсли;	
			
			Исключение
				
				Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
						
				ЗаписьЖурналаРегистрации("Ошибка при изменении статуса 'Заказа клиента' из Яндекс Маркет", 
										 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			КонецПопытки;
			
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ПреобразоватьСтрокуВДату(СтрокаДата)

	СтрокаДата	= СтрЗаменить(СтрокаДата,":","");
	СтрокаДата	= СтрЗаменить(СтрокаДата,"-","");
	СтрокаДата  = СтрЗаменить(СтрокаДата,"T","");
	СтрокаДата  = СтрЗаменить(СтрокаДата,"Z","");
	СтрокаДата  = СтрЗаменить(СтрокаДата," ","");

	Год     = Сред(СтрокаДата,5,4);
	Месяц   = Сред(СтрокаДата,3,2);
	День    = Лев(СтрокаДата,2);
	Час     = Сред(СтрокаДата,9,2);
	Минуты  = Сред(СтрокаДата,11,2);
	Секунды = Прав(СтрокаДата,2);

	Возврат Дата(Год, Месяц, День, Час, Минуты, Секунды);	

КонецФункции

#КонецОбласти  

#Область Ozon

Процедура Ozon_ЗагрузкаЗаказов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
		|	ЗаказКлиента.рар_мп_АккаунтМаркетплейса КАК АккаунтМаркетплейса
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.рар_мп_АккаунтМаркетплейса.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.Ozon)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СозданныеЗаказыКлиентов = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса КАК АккаунтМаркетплейса,
		|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
		|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.Наименование КАК АккаунтМаркетплейсаНаименование
		|ИЗ
		|	РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
		|ГДЕ
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.АктивныйАккаунт = ИСТИНА
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.Ozon)
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.ПометкаУдаления = ЛОЖЬ
		|	И рар_мп_СопоставленныеСклады.Склад.ПометкаУдаления = ЛОЖЬ
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АккаунтМаркетплейса,
		|	УникальныйИдентификаторСклада";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СозданныеАккаунтыИСопоставленныеСклады = РезультатЗапроса.Выгрузить();
	
	АккаунтыOzon = СозданныеАккаунтыИСопоставленныеСклады.ВыгрузитьКолонку("АккаунтМаркетплейса");
	
	ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(АккаунтыOzon);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт КАК Аккаунт,
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	РегистрСведений.рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака КАК рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака
		|ГДЕ
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт В(&Аккаунт)";
	
	Запрос.УстановитьПараметр("Аккаунт", АккаунтыOzon);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВидыНоменклатурыДляЧестногоЗнака = РезультатЗапроса.Выгрузить();
	
	КоличествоЗапросов = 0;
	
	Для каждого Аккаунт Из АккаунтыOzon Цикл
	
		НеобходимоСделатьЕщеОдинЗапрос = Истина;
		
		КоличествоПропущенных = 0;
		
		Лимит = 1000;
		
		Пока НеобходимоСделатьЕщеОдинЗапрос Цикл
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
		
			HTTPОтвет = рар_мп_Ozon_Методы.Метод_СписокОтправлений(Аккаунт, КоличествоПропущенных);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
				Если HTTPОтвет.КодСостояния <> 200 Тогда
								
					НазваниеОшибки = "Ошибка при получении заказов из Ozon";
					
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
					
					Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
											Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					НеобходимоСделатьЕщеОдинЗапрос = Ложь;
				
				Иначе
					
					НеобходимоСделатьЕщеОдинЗапрос = HTTPОтвет.ОтветAPI.result.has_next;
					
					КоличествоПропущенных = КоличествоПропущенных + Лимит;
					
					Заказы = HTTPОтвет.ОтветAPI.result.postings;
					
					Ozon_СозданиеЗаказов(Заказы, Аккаунт, СозданныеЗаказыКлиентов, СозданныеАккаунтыИСопоставленныеСклады, ВидыНоменклатурыДляЧестногоЗнака); 
					
				КонецЕсли;
				
			Иначе
				
				Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
			
				ЗаписьЖурналаРегистрации("Ошибка при получении загрузке заказов", УровеньЖурналаРегистрации.Ошибка,,,
										 СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
				
			КонецЕсли;
			
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Ozon_СозданиеЗаказов(Заказы, Аккаунт, СозданныеЗаказыКлиентов, СозданныеАккаунтыИСопоставленныеСклады, ВидыНоменклатурыДляЧестногоЗнака)
	
	КоличествоЗапросов = 0;
	
	Для каждого Заказ Из Заказы Цикл
		
		Номер = Заказ.posting_number;
		
		ОтказЗаписи = Ложь;
		
		НайденныеСтроки = СозданныеЗаказыКлиентов.НайтиСтроки(Новый Структура("НомерПоДаннымКлиента, АккаунтМаркетплейса", Номер, Аккаунт));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			Если Заказ.status = "awaiting_packaging" Тогда
				
				Попытка
				
					Документ = Документы.ЗаказКлиента.СоздатьДокумент(); 
					
					//Заполнение данными из 1с
					Документ.Статус 			   		= Аккаунт.СтатусЗаказа;
					Документ.Приоритет 			   		= Аккаунт.Приоритет;
					Документ.ХозяйственнаяОперация 		= Аккаунт.Операция;
					Документ.Организация		   		= Аккаунт.Организация;
					Документ.Договор 			  		= Аккаунт.Договор;
					Документ.рар_мп_СтатусДокументаВТСД	= Перечисления.рар_мп_СтатусыДокументовВТСД.Новый;
					
					НайденныеСтрокиСкладов = СозданныеАккаунтыИСопоставленныеСклады.НайтиСтроки(Новый Структура("АккаунтМаркетплейса,УникальныйИдентификаторСклада", 
																												Аккаунт, Формат(Заказ.delivery_method.warehouse_id,"ЧГ=0")));
					Если НайденныеСтрокиСкладов.Количество() = 0 Тогда
					
						ОтказЗаписи = Истина;
						
						Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: Не удалось найти сопоставленный склад с id: %3", 
												Аккаунт, Номер, Формат(Заказ.warehouseId,"ЧГ=0"));
						
						ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
						
						Продолжить;
						
					Иначе
						
						Склад 		   								  = НайденныеСтрокиСкладов.Получить(0).Склад;
						Документ.Склад 								  = Склад;
						Документ.рар_мп_УникальныйИдентификаторСклада = НайденныеСтрокиСкладов.Получить(0).УникальныйИдентификаторСклада;
					
					КонецЕсли;
					
					Если НЕ ОтказЗаписи Тогда
					
						Документ.Контрагент 		   		= Аккаунт.Контрагент;
						Документ.Партнер       		   		= Аккаунт.Партнер;
						Документ.Соглашение 		   		= Аккаунт.Соглашение;
						Документ.Валюта 			   		= Аккаунт.Валюта;
						Документ.НеОтгружатьЧастями    		= Истина;
						Документ.рар_мп_АккаунтМаркетплейса = Аккаунт;
						
						ДатаСоздания  = Заказ.in_process_at;
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,"T","");
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,"Z","");
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,":","");
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,"-","");
						Документ.Дата = Дата(ДатаСоздания);
						
						Если Документ.Соглашение <> Справочники.СоглашенияСКлиентами.ПустаяСсылка() Тогда
						
							Документ.КонтактноеЛицо = Аккаунт.Соглашение.КонтактноеЛицо;
							Документ.Менеджер       = Аккаунт.Соглашение.Менеджер;
							
						ИначеЕсли Документ.Договор <> Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
							
							Документ.КонтактноеЛицо = Аккаунт.Договор.КонтактноеЛицо;
							Документ.Менеджер 		= Аккаунт.Договор.Менеджер;
							
						КонецЕсли; 
						
						Документ.Подразделение 		= Аккаунт.Подразделение;
						Документ.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
						Документ.НалогообложениеНДС = Аккаунт.НалогообложениеНДС;
						Документ.ЦенаВключаетНДС    = Аккаунт.ЦенаВключаетНДС;
						Документ.Автор 				= ПользователиКлиентСервер.ТекущийПользователь();
						
						//Заполнение данными из маркетплейса
						Документ.рар_мп_Ozon_СтатусЗаказа 	 = Перечисления.рар_мп_Ozon_СтатусыЗаказов[Заказ.status];
						Документ.рар_мп_Ozon_ПодстатусЗаказа = Перечисления.рар_мп_Ozon_ПодстатусыЗаказов[Заказ.substatus];
						Документ.НомерПоДаннымКлиента		 = Номер;
						Документ.ДатаПоДаннымКлиента		 = Документ.Дата;
						
						Товары = Заказ.products;
												
						ДатаОтгрузки  = Заказ.shipment_date;
						ДатаОтгрузки  = СтрЗаменить(ДатаОтгрузки,"T","");
						ДатаОтгрузки  = СтрЗаменить(ДатаОтгрузки,"Z","");
						ДатаОтгрузки  = СтрЗаменить(ДатаОтгрузки,":","");
						ДатаОтгрузки  = СтрЗаменить(ДатаОтгрузки,"-","");
						Документ.ДатаОтгрузки = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаОтгрузки);
						
						Если КоличествоЗапросов = 50 Тогда
							
							КоличествоЗапросов = 0;
							
							ВремяОжидания = 5;
							
							ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
							
							Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
								// Ожидаем время для следующего запроса	
							КонецЦикла;
							
						КонецЕсли;
						
						HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПолучитьДанныеСозданныхЭкземпляров(Аккаунт, Номер);
						
						КоличествоЗапросов = КоличествоЗапросов + 1;
								
						КодЗапроса = HTTPОтвет.КодСостояния;
						
						Если HTTPОтвет.Свойство("ОтветAPI") Тогда

							Если КодЗапроса <> 200 Тогда
							
								НазваниеОшибки = "Ошибка получении информации о созданных экземплярах в Ozon";
								
								ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
								
								Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1номер заказа: %4%1Описание ошибки: %5", 
														Символы.ПС, Аккаунт, КодЗапроса, Номер, ОписаниеОшибки);
								
								ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
								
								ОтказЗаписи = Истина; 
								
								Продолжить;
								
							Иначе
								
								Для каждого Товар Из Товары Цикл
									
									СтрокаДокумента = Документ.Товары.Добавить();
									
									НаборЗаписей = РегистрыСведений.рар_мп_Ozon_СопоставленныеТовары.СоздатьНаборЗаписей();
									НаборЗаписей.Отбор.Аккаунт.Установить(Аккаунт);
									НаборЗаписей.Отбор.Артикул.Установить(Товар.offer_id);
									
									НаборЗаписей.Прочитать();
									
									Если НаборЗаписей.Количество() > 0 Тогда
										
										Запись = НаборЗаписей.Получить(0);
										
										СтрокаДокумента.Номенклатура   	   = Запись.Номенклатура;
										СтрокаДокумента.Характеристика 	   = Запись.Характеристика;
										СтрокаДокумента.ВариантОбеспечения = Аккаунт.ВариантОбеспечения;
										СтрокаДокумента.ДатаОтгрузки   	   = Документ.ДатаОтгрузки;
										СтрокаДокумента.Упаковка	   	   = Запись.Упаковка;
										СтрокаДокумента.КоличествоУпаковок = Число(Товар.quantity);
										СтрокаДокумента.Количество		   = СтрокаДокумента.КоличествоУпаковок * Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(СтрокаДокумента.Упаковка, СтрокаДокумента.Номенклатура);
										СтрокаДокумента.Склад			   = Склад;
										СтрокаДокумента.Цена 			   = Товар.price;	
										СтрокаДокумента.Сумма 			   = СтрокаДокумента.КоличествоУпаковок * Товар.price;
										
										СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Номенклатура, "СтавкаНДС");
							
										СтрокаДокумента.СтавкаНДС = СтавкаНДС;
										
										СтруктураПересчетаСуммы = Новый Структура;
										СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Документ.ЦенаВключаетНДС);
										СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Документ.НалогообложениеНДС);
										
										СтруктураДействий = Новый Структура;
										СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
										СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
											
										КэшированныеЗначения = Неопределено;
												
										ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(СтрокаДокумента, СтруктураДействий, КэшированныеЗначения);
										
										Для каждого Продукт Из HTTPОтвет.ОтветAPI.products Цикл
									
											НеобходимоМаркировать_Ozon = Продукт.is_mandatory_mark_needed;
											
											НеобходимГТД_Ozon = Продукт.is_gtd_needed;
											
											ВидНоменклатуры = ВидыНоменклатурыДляЧестногоЗнака.НайтиСтроки(Новый Структура("Аккаунт, ВидНоменклатуры", 
																										Аккаунт,СтрокаДокумента.Номенклатура.ВидНоменклатуры));
									
											Если ВидНоменклатуры.Количество() > 0 Тогда
											
												НеобходимоМаркировать_ВидНоменклатуры = Истина;
												
											Иначе
												
												НеобходимоМаркировать_ВидНоменклатуры = Ложь;	
											
											КонецЕсли;
											
											Если Продукт.product_id = Товар.sku Тогда
											
												Для каждого Экземпляр Из Продукт.exemplars Цикл
											
													СтрокаТоварыКРаспределению = Документ.рар_мп_ТоварыДляМаркировки.Добавить();
												
													СтрокаТоварыКРаспределению.рар_мп_СтрокаИзТЧТовары = Документ.Товары.Количество();
													
													СтрокаТоварыКРаспределению.рар_мп_Номенклатура = СтрокаДокумента.Номенклатура; 
													
													СтрокаТоварыКРаспределению.рар_мп_Характеристика = СтрокаДокумента.Характеристика;
													
													СтрокаТоварыКРаспределению.рар_мп_IDТовара = Формат(Товар.sku,"ЧГ=0");	
													
													СтрокаТоварыКРаспределению.рар_мп_ЗаполнениеМаркировки = НеобходимоМаркировать_Ozon И НеобходимоМаркировать_ВидНоменклатуры;
													
													СтрокаТоварыКРаспределению.рар_мп_Exemplar_Id = Экземпляр.exemplar_id;
													
													СтрокаТоварыКРаспределению.рар_мп_ЗаполнениеГТД = НеобходимГТД_Ozon;
												
												КонецЦикла;
												
												Прервать
											
											КонецЕсли;
										
										КонецЦикла;	
											
									Иначе
										
										ОтказЗаписи = Истина;
										
										Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: Не удалось найти сопоставленный товар с артикулом: %3", 
																Аккаунт, Номер, Товар.offer_id);
									
										ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Ozon", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
										
										Продолжить;
										
									КонецЕсли;
										
								КонецЦикла;		
								
							КонецЕсли;
							
						Иначе
							
							НазваниеОшибки = "Ошибка получении информации о созданных экземплярах в Ozon";
								
							ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
							
							Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Код состояния: %3%1номер заказа: %4%1Описание ошибки: %5", 
													Символы.ПС, Аккаунт, КодЗапроса, Номер, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							ОтказЗаписи = Истина; 
							
							Продолжить;
								
						КонецЕсли;
						Если Не ОтказЗаписи Тогда
							
							Попытка
							
								Документ.Записать(РежимЗаписиДокумента.Проведение);
							
							Исключение 
								  
								Документ.Записать(РежимЗаписиДокумента.Запись);
								
								Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
								
								ЗаписьЖурналаРегистрации("Ошибка при проведении 'Заказа клиента' из Ozon", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							КонецПопытки;
						
						КонецЕсли;	
					
					КонецЕсли;
					
				Исключение
					
					Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
					
					ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Ozon", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				КонецПопытки;	
				
			КонецЕсли;
			
		Иначе
			
			Попытка
			
				Документ = НайденныеСтроки.Получить(0).Ссылка.ПолучитьОбъект();
				
				Если Документ.рар_мп_Ozon_СтатусЗаказа <> Перечисления.рар_мп_Ozon_СтатусыЗаказов[Заказ.status] 
					 ИЛИ Документ.рар_мп_Ozon_ПодстатусЗаказа <> Перечисления.рар_мп_Ozon_ПодстатусыЗаказов[Заказ.substatus] Тогда
					 
					Попытка
					
						Документ.рар_мп_Ozon_СтатусЗаказа    = Перечисления.рар_мп_Ozon_СтатусыЗаказов[Заказ.status];
						Документ.рар_мп_Ozon_ПодстатусЗаказа = Перечисления.рар_мп_Ozon_ПодстатусыЗаказов[Заказ.substatus];
						
						Если Перечисления.рар_мп_Ozon_СтатусыЗаказов[Заказ.status] = Перечисления.рар_мп_Ozon_СтатусыЗаказов.cancelled
							ИЛИ Перечисления.рар_мп_Ozon_СтатусыЗаказов[Заказ.status] = Перечисления.рар_мп_Ozon_СтатусыЗаказов.cancelled_from_split_pending Тогда 
						
							ПричинаОтменыЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "ПричинаОтменыЗаказа");
							
							Если ЗначениеЗаполнено(ПричинаОтменыЗаказа) Тогда
							
								Для каждого СтрокаТчТовары Из Документ.Товары Цикл
								
									СтрокаТчТовары.Отменено = Истина;
									
									СтрокаТчТовары.ПричинаОтмены = ПричинаОтменыЗаказа;
								
								КонецЦикла;
								
								Документ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
							
							Иначе
								
								ОписаниеОшибки = "В личном кабинете не указана причина отмены заказа";
								
								Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки);
							
								ЗаписьЖурналаРегистрации("Ошибка при закрытии документа 'Заказ клиента' после отмены заказа в Ozon", 
												 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);	
							
							КонецЕсли;
						
						КонецЕсли;
						
						Документ.Записать(РежимЗаписиДокумента.Проведение);
					
					Исключение
						
						Документ.Записать(РежимЗаписиДокумента.Запись);
						
						Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
						
						ЗаписьЖурналаРегистрации("Ошибка при изменении статуса 'Заказа клиента' из Ozon", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,); 
					
					КонецПопытки;
					 
					
				КонецЕсли;	
			
			Исключение
				
				Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
						
				ЗаписьЖурналаРегистрации("Ошибка при изменении статуса 'Заказа клиента' из Ozon", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			КонецПопытки;
			
		
		КонецЕсли;
			
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Wildberries

Процедура Wildberries_ЗагрузкаЗаказов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
		|	ЗаказКлиента.рар_мп_АккаунтМаркетплейса КАК АккаунтМаркетплейса
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.рар_мп_АккаунтМаркетплейса.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.Wildberries)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СозданныеЗаказыКлиентов = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса КАК АккаунтМаркетплейса,
		|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
		|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.Наименование КАК АккаунтМаркетплейсаНаименование
		|ИЗ
		|	РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
		|ГДЕ
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.АктивныйАккаунт = ИСТИНА
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.Маркетплейс = ЗНАЧЕНИЕ(Перечисление.рар_мп_Маркетплейсы.Wildberries)
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.ПометкаУдаления = ЛОЖЬ
		|	И рар_мп_СопоставленныеСклады.Склад.ПометкаУдаления = ЛОЖЬ
		|	И рар_мп_СопоставленныеСклады.АккаунтМаркетплейса.СхемаРаботы = ЗНАЧЕНИЕ(Перечисление.рар_мп_СхемыРаботы.FBS)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АккаунтМаркетплейса,
		|	УникальныйИдентификаторСклада";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СозданныеАккаунтыИСопоставленныеСклады = РезультатЗапроса.Выгрузить();
	
	АккаунтыВБ = СозданныеАккаунтыИСопоставленныеСклады.ВыгрузитьКолонку("АккаунтМаркетплейса");
	
	ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(АккаунтыВБ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт КАК Аккаунт,
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	РегистрСведений.рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака КАК рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака
		|ГДЕ
		|	рар_мп_ВидыНоменклатурыДляУчетаЧестногоЗнака.Аккаунт В(&Аккаунт)";
	
	Запрос.УстановитьПараметр("Аккаунт", АккаунтыВБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВидыНоменклатурыДляЧестногоЗнака = РезультатЗапроса.Выгрузить();
	
	СледующаяСтраница = "0";

	Для каждого Аккаунт Из АккаунтыВБ Цикл
	
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьИНформациюОСборочныхЗаданиях(Аккаунт, СледующаяСтраница);
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
							
				НазваниеОшибки = "Ошибка при получении заказов из Wildberries";
				
				Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
			
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
				
				Иначе
				
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.title;	
				
				КонецЕсли;
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
										Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Иначе
				
				Если HTTPОтвет.ОтветAPI.Свойство("next") Тогда
				
					СледующаяСтраница = Строка(Формат(HTTPОтвет.ОтветAPI.next,"ЧГ=0"));
					
				Иначе
					
					СледующаяСтраница = "";
				
				КонецЕсли;
				
				Заказы = HTTPОтвет.ОтветAPI.orders;
				
				Wildberries_СозданиеЗаказов(Заказы, Аккаунт, СозданныеЗаказыКлиентов, СозданныеАккаунтыИСопоставленныеСклады, ВидыНоменклатурыДляЧестногоЗнака);
				
				Пока СледующаяСтраница <> "" Цикл
					
					HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьИНформациюОСборочныхЗаданиях(Аккаунт, СледующаяСтраница);
					
					Если HTTPОтвет.КодСостояния = 429 Тогда
		
						ВремяОжидания = 60;
							
						КонДата = ТекущаяДата() + ВремяОжидания;
						
						Пока ТекущаяДата() < КонДата Цикл
							
						КонецЦикла;
						
						HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьИНформациюОСборочныхЗаданиях(Аккаунт, СледующаяСтраница);
						
					КонецЕсли;
					
					Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
						Если HTTPОтвет.КодСостояния <> 200 Тогда
								
							НазваниеОшибки = "Ошибка при получении заказов из Wildberries";
							
							Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
				
								ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
							
							Иначе
							
								ОписаниеОшибки = HTTPОтвет.ОтветAPI.title;	
							
							КонецЕсли;
							
							Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
													Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							Прервать;
						
						Иначе
							
							Если HTTPОтвет.ОтветAPI.Свойство("next") Тогда
					
								СледующаяСтраница = Строка(Формат(HTTPОтвет.ОтветAPI.next,"ЧГ=0"));
								
							Иначе
								
								СледующаяСтраница = "";
							
							КонецЕсли;
							
							Заказы = HTTPОтвет.ОтветAPI.orders;
							
							Wildberries_СозданиеЗаказов(Заказы, Аккаунт, СозданныеЗаказыКлиентов, СозданныеАккаунтыИСопоставленныеСклады, ВидыНоменклатурыДляЧестногоЗнака);
							
						КонецЕсли;
						
					Иначе
						
						Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
						ЗаписьЖурналаРегистрации("Ошибка при получении загрузке заказов", УровеньЖурналаРегистрации.Ошибка,,,
												 СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
				
			Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
			ЗаписьЖурналаРегистрации("Ошибка при получении загрузке заказов", УровеньЖурналаРегистрации.Ошибка,,,
									 СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Процедура Wildberries_СозданиеЗаказов(Заказы, Аккаунт, СозданныеЗаказыКлиентов, СозданныеАккаунтыИСопоставленныеСклады, ВидыНоменклатурыДляЧестногоЗнака)

	Для каждого Заказ Из Заказы Цикл
	
		Номер = Формат(Заказ.id,"ЧГ=0");
		
		НайденныеСтроки = СозданныеЗаказыКлиентов.НайтиСтроки(Новый Структура("НомерПоДаннымКлиента, АккаунтМаркетплейса", Строка(Номер), Аккаунт));
		
		СтатусыЗаказа = Wildberries_ПолучитьСтатусЗаказа(Аккаунт, Число(Номер));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			Если СтатусыЗаказа.Получить("СтатусОбработкиЗаказа") = "new" И СтатусыЗаказа.Получить("СтатусЗаказа") = "waiting" Тогда
				
				Попытка
				
					ОтказЗаписи = Ложь;
				
					Документ = Документы.ЗаказКлиента.СоздатьДокумент(); 
					
					//Заполнение данными из 1с
					Документ.Статус 			   		= Аккаунт.СтатусЗаказа;
					Документ.Приоритет 			   		= Аккаунт.Приоритет;
					Документ.ХозяйственнаяОперация 		= Аккаунт.Операция;
					Документ.Организация		   		= Аккаунт.Организация;
					Документ.Договор 			  		= Аккаунт.Договор;
					Документ.рар_мп_СтатусДокументаВТСД	= Перечисления.рар_мп_СтатусыДокументовВТСД.Новый;
					
					НайденныеСтрокиСкладов = СозданныеАккаунтыИСопоставленныеСклады.НайтиСтроки(Новый Структура("АккаунтМаркетплейса,УникальныйИдентификаторСклада", 
																												Аккаунт, Формат(Заказ.warehouseId,"ЧГ=0")));
					
					Если НайденныеСтрокиСкладов.Количество() = 0 Тогда
					
						ОтказЗаписи = Истина;
						
						Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: Не удалось найти сопоставленный склад с id: %3", 
												Аккаунт, Номер, Формат(Заказ.warehouseId,"ЧГ=0"));
						
						ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
						
						Продолжить;
						
					Иначе
						
						Склад 		   								  = НайденныеСтрокиСкладов.Получить(0).Склад;
						Документ.Склад 								  = Склад;
						Документ.рар_мп_УникальныйИдентификаторСклада = НайденныеСтрокиСкладов.Получить(0).УникальныйИдентификаторСклада;
					
					КонецЕсли;
					
					Если НЕ ОтказЗаписи Тогда
					
						Документ.Контрагент 		   		= Аккаунт.Контрагент;
						Документ.Партнер       		   		= Аккаунт.Партнер;
						Документ.Соглашение 		   		= Аккаунт.Соглашение;
						Документ.Валюта 			   		= Аккаунт.Валюта;
						Документ.рар_мп_АккаунтМаркетплейса = Аккаунт;
						
						ДатаСоздания  = Заказ.createdAt;
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,"T","");
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,"Z","");
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,":","");
						ДатаСоздания  = СтрЗаменить(ДатаСоздания,"-","");
						Документ.Дата = Дата(ДатаСоздания);
						
						Если Документ.Соглашение <> Справочники.СоглашенияСКлиентами.ПустаяСсылка() Тогда
						
							Документ.КонтактноеЛицо = Аккаунт.Соглашение.КонтактноеЛицо;
							Документ.Менеджер       = Аккаунт.Соглашение.Менеджер;
							
						ИначеЕсли Документ.Договор <> Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
							
							Документ.КонтактноеЛицо = Аккаунт.Договор.КонтактноеЛицо;
							Документ.Менеджер 		= Аккаунт.Договор.Менеджер;
							
						КонецЕсли; 
						
						Документ.Подразделение 		= Аккаунт.Подразделение;
						Документ.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
						Документ.НалогообложениеНДС = Аккаунт.НалогообложениеНДС;
						Документ.ЦенаВключаетНДС    = Аккаунт.ЦенаВключаетНДС;
						Документ.Автор 				= ПользователиКлиентСервер.ТекущийПользователь();
						Документ.ДатаОтгрузки	    = ТекущаяДатаСеанса();
						Документ.НеОтгружатьЧастями = Истина;
						
						//Заполнение данными из маркетплейса
						СтатусЗаказа 		  = СтатусыЗаказа.Получить("СтатусЗаказа");
						СтатусОбработкиЗаказа = СтатусыЗаказа.Получить("СтатусОбработкиЗаказа");
						
						Документ.рар_мп_Wildberries_СтатусЗаказа 	      = Перечисления.рар_мп_Wildberries_СтатусыЗаказов[СтатусЗаказа];
						Документ.рар_мп_Wildberries_СтатусОбработкиЗаказа = Перечисления.рар_мп_Wildberries_СтатусыОбработкиЗаказов[СтатусОбработкиЗаказа];
						Документ.НомерПоДаннымКлиента				 	  = Строка(Номер);
						Документ.ДатаПоДаннымКлиента				 	  = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСоздания);
						
						СтрокаДокумента = Документ.Товары.Добавить();
						
						Запись 		     = РегистрыСведений.рар_мп_Wildberries_СопоставленныеТовары.СоздатьМенеджерЗаписи();
						Запись.Аккаунт   = Аккаунт;
						Запись.IDТовара  = Заказ.nmId;
						Запись.Артикул   = Заказ.article;
						Запись.Баракод   = Заказ.skus.Получить(0);
						
						Запись.Прочитать();
						
						Если Запись.Выбран() Тогда
							
							СтрокаДокумента.Номенклатура   	   = Запись.Номенклатура;
							СтрокаДокумента.Характеристика 	   = Запись.Характеристика;
							СтрокаДокумента.ВариантОбеспечения = Аккаунт.ВариантОбеспечения;
							СтрокаДокумента.ДатаОтгрузки	   = ТекущаяДатаСеанса();
							СтрокаДокумента.Упаковка	   	   = Запись.Упаковка;
							СтрокаДокумента.КоличествоУпаковок = 1;
							СтрокаДокумента.Количество		   = СтрокаДокумента.КоличествоУпаковок * Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(СтрокаДокумента.Упаковка, СтрокаДокумента.Номенклатура);
							СтрокаДокумента.Склад			   = Склад;
							СтрокаДокумента.Цена  	  		   = Заказ.convertedPrice / 100;
							СтрокаДокумента.Сумма 	  		   = СтрокаДокумента.Цена;
							
							СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Номенклатура, "СтавкаНДС");
							
							СтрокаДокумента.СтавкаНДС = СтавкаНДС;
							
							СтруктураПересчетаСуммы = Новый Структура;
							СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Документ.ЦенаВключаетНДС);
							СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Документ.НалогообложениеНДС);
							
							СтруктураДействий = Новый Структура;
							СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
							СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
								
							КэшированныеЗначения = Неопределено;
									
							ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(СтрокаДокумента, СтруктураДействий, КэшированныеЗначения); 
							
							Для Счетчик = 1 По СтрокаДокумента.Количество Цикл
							
								СтрокаТоварыКРаспределению = Документ.рар_мп_ТоварыДляМаркировки.Добавить();
								
								СтрокаТоварыКРаспределению.рар_мп_СтрокаИзТЧТовары = Документ.Товары.Индекс(СтрокаДокумента) + 1;
								
								СтрокаТоварыКРаспределению.рар_мп_Номенклатура = СтрокаДокумента.Номенклатура; 
								
								СтрокаТоварыКРаспределению.рар_мп_Характеристика = СтрокаДокумента.Характеристика;
								
								СтрокаТоварыКРаспределению.рар_мп_IDТовара = Формат(Заказ.nmId,"ЧГ=0");
								
								ВидНоменклатуры = ВидыНоменклатурыДляЧестногоЗнака.НайтиСтроки(Новый Структура("Аккаунт, ВидНоменклатуры", 
																										Аккаунт,СтрокаДокумента.Номенклатура.ВидНоменклатуры));
									
								Если ВидНоменклатуры.Количество() > 0 Тогда
								
									СтрокаТоварыКРаспределению.рар_мп_ЗаполнениеМаркировки = Истина;	
								
								КонецЕсли;
								
							КонецЦикла;
								
						Иначе
							
							ОтказЗаписи = Истина;
							
							Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: Не удалось найти сопоставленный товар с баракодом: %3",
													Аккаунт, Номер, Заказ.skus.Получить(0));
						
							ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Wildberries", УровеньЖурналаРегистрации.Ошибка,,, Комментарий,);
							
							Продолжить;
							
						КонецЕсли;
						
						Если Не ОтказЗаписи Тогда
							
							Попытка
							
								Документ.Записать(РежимЗаписиДокумента.Проведение);
							
							Исключение 
								  
								Документ.Записать(РежимЗаписиДокумента.Запись);
								
								Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
								
								ЗаписьЖурналаРегистрации("Ошибка при проведении 'Заказа клиента' из Wildberries", 
														 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							КонецПопытки;
						
						КонецЕсли;
					
					КонецЕсли;
						
				Исключение
					
					Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
					
					ЗаписьЖурналаРегистрации("Ошибка при загрузке 'Заказа клиента' из Wildberries", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			
			Попытка
			
				Документ = НайденныеСтроки.Получить(0).Ссылка.ПолучитьОбъект();
			
				СтатусЗаказа 		  = СтатусыЗаказа.Получить("СтатусЗаказа");	
				СтатусОбработкиЗаказа = СтатусыЗаказа.Получить("СтатусОбработкиЗаказа");
				
				Если СтатусЗаказа <> "" И СтатусОбработкиЗаказа <> "" Тогда
				
					Если Документ.рар_мп_Wildberries_СтатусЗаказа <> Перечисления.рар_мп_Wildberries_СтатусыЗаказов[СтатусЗаказа] 
					    ИЛИ Документ.рар_мп_Wildberries_СтатусОбработкиЗаказа <> 
								Перечисления.рар_мп_Wildberries_СтатусыОбработкиЗаказов[СтатусОбработкиЗаказа] Тогда
						 
						Попытка
						
							Документ.рар_мп_Wildberries_СтатусЗаказа          = Перечисления.рар_мп_Wildberries_СтатусыЗаказов[СтатусЗаказа];
							Документ.рар_мп_Wildberries_СтатусОбработкиЗаказа = Перечисления.рар_мп_Wildberries_СтатусыОбработкиЗаказов[СтатусОбработкиЗаказа];
							
							Если Перечисления.рар_мп_Wildberries_СтатусыЗаказов[СтатусЗаказа] = Перечисления.рар_мп_Wildberries_СтатусыЗаказов.canceled
								ИЛИ Перечисления.рар_мп_Wildberries_СтатусыЗаказов[СтатусЗаказа] = Перечисления.рар_мп_Wildberries_СтатусыЗаказов.canceled_by_client
								ИЛИ Перечисления.рар_мп_Wildberries_СтатусыЗаказов[СтатусЗаказа] = Перечисления.рар_мп_Wildberries_СтатусыЗаказов.declined_by_client
								ИЛИ Перечисления.рар_мп_Wildberries_СтатусыЗаказов[СтатусЗаказа] = Перечисления.рар_мп_Wildberries_СтатусыЗаказов.defect Тогда  
						
								ПричинаОтменыЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "ПричинаОтменыЗаказа");
								
								Если ЗначениеЗаполнено(ПричинаОтменыЗаказа) Тогда
								
									Для каждого СтрокаТчТовары Из Документ.Товары Цикл
									
										СтрокаТчТовары.Отменено = Истина;
										
										СтрокаТчТовары.ПричинаОтмены = ПричинаОтменыЗаказа;
									
									КонецЦикла;
									
									Документ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
								
								Иначе
									
									ОписаниеОшибки = "В личном кабинете не указана причина отмены заказа";
									
									Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки);
								
									ЗаписьЖурналаРегистрации("Ошибка при закрытии документа 'Заказ клиента' после отмены заказа в Wildberries", 
													 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);	
								
								КонецЕсли;
							
							КонецЕсли;
							
							Документ.Записать(РежимЗаписиДокумента.Проведение);
						
						Исключение
							
							Документ.Записать(РежимЗаписиДокумента.Запись);
							
							Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
							
							ЗаписьЖурналаРегистрации("Ошибка при изменении статуса 'Заказа клиента' из Wildberries", 
													 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,); 
						
						КонецПопытки;
						 	
					КонецЕсли;	
				
				КонецЕсли;	
			
			Исключение
				
				Комментарий = СтрШаблон("Аккаунт: %1. Номер заказа: %2. Описание ошибки: %3", Аккаунт, Номер, ОписаниеОшибки());
						
				ЗаписьЖурналаРегистрации("Ошибка при изменении статуса 'Заказа клиента' из Wildberries", 
										  УровеньЖурналаРегистрации.Ошибка,,,Комментарий,); 
					

			КонецПопытки;
			
			
		КонецЕсли;
	
	КонецЦикла;		

КонецПроцедуры

Функция Wildberries_ПолучитьСтатусЗаказа(Аккаунт, НомерЗаказа)

	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьСтатусыСборочныхЗаданий(Аккаунт, НомерЗаказа); 
	
	Если HTTPОтвет.КодСостояния = 429 Тогда
	
		ВремяОжидания = 60;
			
		КонДата = ТекущаяДата() + ВремяОжидания;
		
		Пока ТекущаяДата() < КонДата Цикл
			
		КонецЦикла;
		
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьСтатусыСборочныхЗаданий(Аккаунт, НомерЗаказа);
		
	КонецЕсли;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
		Если HTTPОтвет.КодСостояния <> 200 Тогда
						
			НазваниеОшибки = "Ошибка при получении статусов заказа из Wildberries";
			
			Если HTTPОтвет.ОтветAPI.Свойство("message") Тогда
			
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.message;	
			
			Иначе
			
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.title;	
			
			КонецЕсли;
				
			Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Номер заказа: %4%1Описание ошибки: %5", 
									Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, НомерЗаказа, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,); 
			
			СоответствиеСтатусыЗаказа = Новый Соответствие;
			
		    СоответствиеСтатусыЗаказа.Вставить("СтатусЗаказа", "");
			СоответствиеСтатусыЗаказа.Вставить("СтатусОбработкиЗаказа", "");
			
			Возврат СоответствиеСтатусыЗаказа;
			
		Иначе
			
			Попытка
			
				СтатусЗаказа = HTTPОтвет.ОтветAPI.orders.Получить(0).wbStatus;
				
				СтатусОбработкиЗаказа = HTTPОтвет.ОтветAPI.orders.Получить(0).supplierStatus;
				
				СоответствиеСтатусыЗаказа = Новый Соответствие;
				
				СоответствиеСтатусыЗаказа.Вставить("СтатусЗаказа", СтатусЗаказа);
				СоответствиеСтатусыЗаказа.Вставить("СтатусОбработкиЗаказа", СтатусОбработкиЗаказа);
				
				Возврат СоответствиеСтатусыЗаказа;
			
			Исключение
				
				НазваниеОшибки = "Ошибка при получении статусов заказа из Wildberries";
				
				Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Код состояния: %3%1Номер заказа: %4%1Описание ошибки: %5", 
									Символы.ПС, Аккаунт, HTTPОтвет.КодСостояния, НомерЗаказа, ОписаниеОшибки());
			
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,); 
				
				СоответствиеСтатусыЗаказа = Новый Соответствие;
				
			    СоответствиеСтатусыЗаказа.Вставить("СтатусЗаказа", "");
				СоответствиеСтатусыЗаказа.Вставить("СтатусОбработкиЗаказа", "");
				
				Возврат СоответствиеСтатусыЗаказа;
		
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении загрузке заказов", УровеньЖурналаРегистрации.Ошибка,,,
								 СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
								 
		СоответствиеСтатусыЗаказа = Новый Соответствие;
			
	    СоответствиеСтатусыЗаказа.Вставить("СтатусЗаказа", "");
		СоответствиеСтатусыЗаказа.Вставить("СтатусОбработкиЗаказа", "");
		
		Возврат СоответствиеСтатусыЗаказа;
		
	КонецЕсли;

КонецФункции


#КонецОбласти

#Область ПрочиеПроцедурыИФункции


#КонецОбласти
